lamilami/jk-stm32f103-rabbit/sw/all_demo/mmc_sd.c

#include "stm32f10x.h"
#include <stm32f10x_spi.h>

#include "hw_config.h"
#include "mmc_sd.h"
#include "spi.h"
#include "usart.h"

u8 SD_Type = 0; // SD card type


// 2010/5/13
// Add some delay, measured to support TF card (1G/2G), Kingston 2G, 4G 16G SD Card
// 2010/6/24
// Added u8 SD_GetResponse (u8 Response) function
// Modified u8 SD_WaitDataReady (void) function
// Added USB card reader support u8 MSD_ReadBuffer (u8 * pBuffer, u32 ReadAddr, u32 NumByteToRead);
// And u8 MSD_WriteBuffer (u8 * pBuffer, u32 WriteAddr, u32 NumByteToWrite); two functions

void bsp_sd_gpio_init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	/* For use SD socket */
	/* Configure SPI1 pins: SCK, MISO and MOSI */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* Configure PA3 pin: CS pin */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);


#if 1 
	// schematic error : duplicate SPI control pin.
	/* Configure PD2 pin: SPI1_MOSI pin */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOD, &GPIO_InitStructure);

	/* Configure PC12 pin: SPI1_SCK pin */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	/* Configure PC11 pin: SPI1_CS pin */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif

}


// Initialize SD card
// Return if successful, it will automatically set the speed to 18Mhz SPI
// Return value: 0: NO_ERR
// 1: TIME_OUT
// 99: NO_CARD
u8 SD_Init (void)
{
	SPI_InitTypeDef   SPI_InitStructure;
	u8 r1; // return value of SD card storage
	u16 retry; // used to count out
	u8 buff[6] = {0,0,0,0,0};

	MSD_CS_DISABLE();

	// bsp_init_spi1();

	/* SPI1 Config */
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	SPI_InitStructure.SPI_CRCPolynomial = 7;
	SPI_Init(SPI1, &SPI_InitStructure);

	/* SPI1 enable */
	SPI_Cmd(SPI1, ENABLE);
	
	bsp_set_spi1_speed(SPI_SPEED_256);

	// start transmission
	bsp_readwritebyte_spi1(0xff);


	if (SD_Idle_Sta()) 
		return 1; 	// 1 set out to return to the idle mode failed

	//----------------- SD card is reset to the idle end of the -----------------
	// Get the SD card version
	MSD_CS_ENABLE();

	r1 = SD_SendCommand_NoDeassert (8, 0x1aa, 0x87);

	// If the version information is the v1.0 version of the card, ie r1 = 0x05, then the following initialization
	if (r1 == 0x05)
	{
		// Set the card type to SDV1.0, if the latter is detected as the MMC card, and then modified to MMC
		SD_Type = SD_TYPE_V1;
		// If the V1.0 card, CMD8 instruction did not follow-up data
		// Set chip select high end of the second order
		MSD_CS_ENABLE();

		// Multiple 8 CLK, so that the end of follow-up operation SD
		bsp_readwritebyte_spi1 (0xFF);

		//----------------- SD card, MMC card initialization -----------------
		// Initialize command CMD55 + ACMD41 Card
		// If there is response, that is the SD card, and the initialization is complete
		// No response, that is the MMC card, the corresponding additional initialization
		retry = 0;
		do
		{
			// Starting CMD55, should return 0x01; or wrong
			r1 = SD_SendCommand (CMD55, 0, 0);
			if (r1 == 0XFF) return r1; // if not 0xff, then sent to

			// Get the correct response, sent ACMD41, the return value should be 0x00, otherwise retry 200
			r1 = SD_SendCommand (ACMD41, 0, 0);

			retry++;
	    } while ((r1 != 0x00) && (retry <400));
		
	    // Determine the correct response is the time-out or
	    // If response: is the SD card; did not respond: is the MMC card
	    //---------- MMC card for additional initialization started ------------
	    if (retry == 400)
	    {
			retry = 0;
			// Initialize command to send MMC card (not tested)
			do
			{
			    r1 = SD_SendCommand (1,0,0);
			    retry++;
			} while ((r1 != 0x00) && (retry <400));

			if (retry == 400) return 1; // MMC card initialization timed out

			// Write card type
			SD_Type = SD_TYPE_MMC;
	    }
		
	    //---------- MMC card for additional initialization end ------------
	    // Set SPI high-speed mode
	    bsp_set_spi1_speed(SPI_SPEED_4);
	    bsp_readwritebyte_spi1 (0xFF);
		
	    // Disable CRC check
	    r1 = SD_SendCommand (CMD59, 0, 0x95);
	    if (r1 != 0x00) 
			return r1; // command error, returns r1
	    
	    // Set Sector Size
	    r1 = SD_SendCommand (CMD16, 512, 0x95);
	    if (r1 != 0x00) 
			return r1; // command error, returns r1
	    //----------------- SD card, MMC card initialization ended -----------------

	} 
	// SD Card for the V1.0 version of the initialization is complete
	
	// Here is the card initialization V2.0
	// Which need to read the OCR data, with a diagnosis or SD2.0HC Card SD2.0
	else if (r1 == 0x01)
	{
	    // V2.0 card, CMD8 command returns 4 bytes of data, and then to skip the end of the command
	    buff[0] = bsp_readwritebyte_spi1 (0xFF); // should be 0x00
	    buff[1] = bsp_readwritebyte_spi1 (0xFF); // should be 0x00
	    buff[2] = bsp_readwritebyte_spi1 (0xFF); // should be 0x01
	    buff[3] = bsp_readwritebyte_spi1 (0xFF); // should be 0xAA
	    
	    MSD_CS_DISABLE();
	    bsp_readwritebyte_spi1 (0xFF); // the next 8 clocks
	    // Determine whether the card supports a voltage range of 2.7V-3.6V
	    // If (buff [2] == 0x01 && buff [3] == 0xAA) // do not judge, let the cards to support more
	    {
			retry = 0;
			// Initialize command CMD55 + ACMD41 Card
			do
			{
				r1 = SD_SendCommand (CMD55, 0, 0);
				if (r1 != 0x01) return r1;

