lamilami/jk-stm32f103-rabbit/sw/all_demo/mmc_sd.c
				r1 = SD_SendCommand (ACMD41, 0x40000000, 0);
				if (retry> 200) return r1; // timeout return status r1
			} while (r1 != 0);
			
			// Initialize command to send to complete, the next access to OCR information
			// SD2.0 card identification since version 
			//----------- -----------
			r1 = SD_SendCommand_NoDeassert (CMD58, 0, 0);
			if (r1 != 0x00)
			{
				MSD_CS_DISABLE(); // release chip select signal SD
				return r1; // If the command does not return the correct response, direct withdrawal, return response
			} // Read OCR command is issued, followed by 4 bytes of OCR information

			buff [0] = bsp_readwritebyte_spi1 (0xFF);
			buff [1] = bsp_readwritebyte_spi1 (0xFF);
			buff [2] = bsp_readwritebyte_spi1 (0xFF);
			buff [3] = bsp_readwritebyte_spi1 (0xFF);

			// OCR to receive complete set of high chip select
			MSD_CS_DISABLE();
			bsp_readwritebyte_spi1 (0xFF);

			// Check the received OCR in bit30-bit (CCS), was identified as SD2.0 SDHC
			// If the CCS = 1: SDHC CCS = 0: SD2.0
			if (buff [0] & 0x40) 
				SD_Type = SD_TYPE_V2HC; // Check the CCS
			else 
				SD_Type = SD_TYPE_V2;
			//----------- Identification card version of SD2.0 end -----------
			// Set SPI high-speed mode
			bsp_set_spi1_speed(SPI_SPEED_4);
	    }
	}
	return r1;
	
}

// Wait for response to SD card
// Response: to get the feedback value
// Return value: 0, success has been the value of the response
// Otherwise, get the value of failure to respond
u8 SD_GetResponse (u8 Response)
{
	u16 Count = 0xFFF; // wait times

	while ((bsp_readwritebyte_spi1 (0XFF) != Response) && Count) 
		Count--; // waiting to get an accurate response

	if (Count == 0) 
		return MSD_RESPONSE_FAILURE; // get a response failure
	else 
		return MSD_RESPONSE_NO_ERROR; // correct response
}

// Wait for write to complete the SD card
// Return value: 0 success;
// Other, error codes;
u8 SD_WaitDataReady (void)
{
	u8 r1 = MSD_DATA_OTHER_ERROR;
	u32 retry;
	retry = 0;
	do
	{
       	 r1 = bsp_readwritebyte_spi1 (0xFF) &0X1F; // read response
       	 
        	if (retry == 0xfffe) 
			return 1;
			
		retry++;
		
		switch (r1)
		{
		case MSD_DATA_OK: // correct the data reception
			r1 = MSD_DATA_OK;
			break;
		case MSD_DATA_CRC_ERROR: // CRC checksum error
			return MSD_DATA_CRC_ERROR;
		case MSD_DATA_WRITE_ERROR: // Data write error
			return MSD_DATA_WRITE_ERROR;
		default: // Unknown error
			r1 = MSD_DATA_OTHER_ERROR;
		break;
		}
	} while (r1 == MSD_DATA_OTHER_ERROR); // data errors have been waiting for
	
	retry = 0;
	while (bsp_readwritebyte_spi1 (0XFF) == 0) // read data to 0, the data has not yet completed writing
	{
		retry++;
		
		// Delay_us (10); // SD card write takes a long time to wait
		if (retry >= 0XFFFFFFFE) 
			return 0XFF; // Wait failed
	};
	return 0; // success
}


// Send a command to the SD card
// Input: u8 cmd command
// U32 arg command arguments
// U8 crc crc checksum
// Return value: SD card, the response returned
u8 SD_SendCommand (u8 cmd, u32 arg, u8 crc)
{
	u8 r1;
	u8 Retry = 0;

	// Close the chip select
	MSD_CS_DISABLE();
	
	bsp_readwritebyte_spi1 (0xff); // high-speed write command delay
	bsp_readwritebyte_spi1 (0xff);
	bsp_readwritebyte_spi1 (0xff);
	
	// Chip select low-end set, select the SD card
	MSD_CS_ENABLE();
	
	// Send
	bsp_readwritebyte_spi1 (cmd | 0x40); // write command, respectively,
	bsp_readwritebyte_spi1 (arg>> 24);
	bsp_readwritebyte_spi1 (arg>> 16);
	bsp_readwritebyte_spi1 (arg>> 8);
	bsp_readwritebyte_spi1 (arg);
	bsp_readwritebyte_spi1 (crc);
	
	// Wait for a response, or time-out exit
	while ((r1 = bsp_readwritebyte_spi1 (0xFF)) == 0xFF)
	{
		Retry++;
		if (Retry> 200) 
			break;
	}
	
	// Close the chip select
	MSD_CS_DISABLE();
	
	// Additional 8 on the bus clock, so that SD card to complete the remaining work
	bsp_readwritebyte_spi1 (0xFF);
	
	// Return status values
	return r1;
	
}

// Send a command to the SD card (the end is yet to chip select, there came the follow-up data)
// Input: u8 cmd command
// U32 arg command arguments
// U8 crc crc checksum
// Return value: SD card, the response returned
u8 SD_SendCommand_NoDeassert (u8 cmd, u32 arg, u8 crc)
{
	u8 Retry = 0;
	u8 r1;
	
	bsp_readwritebyte_spi1 (0xff); // high-speed write command delay
	bsp_readwritebyte_spi1 (0xff);

	// chip select low-end set, select the SD card
	MSD_CS_ENABLE(); 
	
	// Send
	bsp_readwritebyte_spi1 (cmd | 0x40); // write command, respectively,
	bsp_readwritebyte_spi1 (arg>> 24);
	bsp_readwritebyte_spi1 (arg>> 16);
	bsp_readwritebyte_spi1 (arg>> 8);
	bsp_readwritebyte_spi1 (arg);
	bsp_readwritebyte_spi1 (crc);
	
	// Wait for a response, or time-out exit
	while ((r1 = bsp_readwritebyte_spi1 (0xFF)) == 0xFF)
	{
	    Retry++;
	    if (Retry> 200) 
			break;
	}
	
	// Return the response value
	return r1;
}

// Set the SD card into suspend mode
// Return value: 0, successfully set
// 1, setup failed
u8 SD_Idle_Sta (void)
{
	u16 i;
	u8 r1;
	u8 retry;

	for (i = 0; i <0xf00; i++);// pure delay, waiting for complete power-SD card

	// Should generate> 74 pulses, so that SD card to complete their initialization
	for (i = 0; i <10; i++) bsp_readwritebyte_spi1 (0xFF);

	//----------------- SD card is reset to the idle start -----------------
	// Loop continuously sending CMD0, until the SD card back 0x01, enter the IDLE state
	// Timeout then exit
	retry = 0;
	do
	{
		// Send CMD0, so that SD card into the IDLE state
		r1 = SD_SendCommand (CMD0, 0, 0x95);
		retry++;
	} while ((r1 != 0x01) && (retry <200));

	// Exit the loop, check reason: Initialization successful? or try out?
	if (retry == 200) return 1; // fail

	return 0; // success
}


// Read back from the SD card in the specified length of data placed in a given position
// Input: u8 * data (read back the data storage memory> len)
// U16 len (data length)
// U8 release (whether to release the bus after transfer CS is set high 0: do not release 1: Release)
// Return value: 0: NO_ERR
// Other: Error Message
u8 SD_ReceiveData (u8 * data, u16 len, u8 release)
{
	// Start the first transfer
	MSD_CS_ENABLE();
	if (SD_GetResponse (0xFE)) // wait for data sent back to the starting SD card token 0xFE
	{
		MSD_CS_DISABLE();
		return 1;
	}
	
	while (len--) // Start receiving data
	{
		*data = bsp_readwritebyte_spi1 (0xFF);
		data++;
	}
	
