lamilami/jk-stm32f103-rabbit/sw/all_demo/mmc_sd.c
	// Here are two pseudo-CRC (dummy CRC)
	bsp_readwritebyte_spi1 (0xFF);
	bsp_readwritebyte_spi1 (0xFF);
	if (release == RELEASE) // demand the release of the bus, the CS is set high
	{
		MSD_CS_DISABLE(); // end of transmission
		bsp_readwritebyte_spi1 (0xFF);
	}
	return 0;
}

// Get the SD card CID information, including manufacturer information
// Input: u8 * cid_data (CID stored in the memory, at least 16Byte)
// Return value: 0: NO_ERR
// 1: TIME_OUT
// Other: Error Message
u8 SD_GetCID (u8 * cid_data)
{
	u8 r1;
	
	// Send CMD10 command, read CID
	r1 = SD_SendCommand(CMD10,0,0xff);
	
	if (r1 != 0x00) 
		return r1; // do not return the correct answer, then exit, error
		
	SD_ReceiveData (cid_data, 16, RELEASE); // 16 bytes of data received
	return 0;
}

// Get the SD card, CSD, including the capacity and speed of information
// Input: u8 * cid_data (CID stored in the memory, at least 16Byte)
// Return value: 0: NO_ERR
// 1: TIME_OUT
// Other: Error Message
u8 SD_GetCSD (u8 *csd_data)
{
	u8 r1;
	
	r1 = SD_SendCommand(CMD9, 0, 0xff); // send CMD9 command, read CSD
	
	if (r1) 
		return r1; // do not return the correct answer, then exit, error
		
	SD_ReceiveData (csd_data, 16, RELEASE); // 16 bytes of data received
	
	return 0;
}

// Get the SD card capacity (bytes)
// Return value: 0: take capacity error
// Other: SD card capacity (bytes)
u32 SD_GetCapacity (void)
{
	u8 csd [16];
	u32 Capacity;
	u8 r1;
	u16 i;
	u16 temp;
	// Get CSD information, if during the error, return 0
	if (SD_GetCSD (csd) != 0) return 0;
	
	// If the SDHC card, calculated in accordance with the following
	if ((csd [0] & 0xC0) == 0x40)
	{
		Capacity = ((u32) csd [8]) <<8;
		Capacity += (u32) csd [9] +1;
		Capacity = (Capacity) * 1024; // get number of sectors
		Capacity *= 512; // get number of bytes
	}
	else
	{
		int j;

		for(j=0;j<16;j++)
			usart1_transmit_string_format("%x\r\n", csd[j]);
	
		i = csd [6] &0x03;
		usart1_transmit_string_format("\r\ni=%x", i);
		i <<= 8;
		usart1_transmit_string_format("\r\ni=%x", i);
		i += csd [7];
		usart1_transmit_string_format("\r\ni=%x", i);
		i <<= 2;
		usart1_transmit_string_format("\r\ni=%x", i);
		i += ((csd [8] & 0xc0)>> 6);
		usart1_transmit_string_format("\r\ni=%x", i);
		
		// C_SIZE_MULT
		r1 = csd [9] &0x03;
		r1 <<= 1;
		r1 += ((csd [10] & 0x80)>> 7);
		r1 += 2; // BLOCKNR
		temp = 1;
		
		while (r1)
		{
			temp *= 2;
			r1--;
		}
		
		Capacity = ((u32) (i +1 ))*(( u32) temp);

		usart1_transmit_string_format("\r\ntemp=%d,  Capacity=%d, i=%d\r\n", temp, Capacity, i);
		
		// READ_BL_LEN
		i = csd [5] &0x0f;
		
		// BLOCK_LEN
		temp = 1;
		
		while (i)
		{
			temp *= 2;
			i--;
		}

		usart1_transmit_string_format("\r\\ntemp=%d,  Capacity=%d Bytes\r\n", temp, Capacity);
		
		// The final result
		Capacity *= (u32) temp; // in bytes
	}
	return (u32) Capacity;
}

// Read a block SD card
// Input: u32 sector to take the address (sector value, non-physical address)
// U8 * buffer data storage location (size at least 512byte)
// Return value: 0: Success
// Other: failure
u8 SD_ReadSingleBlock (u32 sector, u8 * buffer)
{
	u8 r1;
	
	// Set to high-speed mode
	// bsp_set_spi1_speed(SPI_SPEED_4);
	
	// If it is not SDHC, given that the sector address, convert it into a byte address
	if (SD_Type != SD_TYPE_V2HC)
	{
	    sector = sector <<9;
	}
	
	r1 = SD_SendCommand (CMD17, sector, 0); // read command
	
	if (r1 != 0x00) return r1;
	
	r1 = SD_ReceiveData (buffer, 512, RELEASE);
	if (r1 != 0) 
		return r1; // read data error!
	else 
		return 0;
}
//////////////////////////// Function of the following two required 
/////////// USB reader //////////////
// Define block size SD card
#define BLOCK_SIZE 512

// Write MSD / SD data
// PBuffer: Data Storage
// ReadAddr: writing the first address
// NumByteToRead: number of bytes to write
// Return value: 0, write to complete
// Otherwise, write failure
u8 MSD_WriteBuffer (u8 * pBuffer, u32 WriteAddr, u32 NumByteToWrite)
{
	u32 i, NbrOfBlock = 0, Offset = 0;
	u32 sector;
	u8 r1;
	
	NbrOfBlock = NumByteToWrite / BLOCK_SIZE; // get the number of blocks to be written
	MSD_CS_ENABLE();
	
	while (NbrOfBlock--) // write a sector
	{
		sector = WriteAddr + Offset;
		if (SD_Type == SD_TYPE_V2HC) sector >>= 9; // perform the reverse operation and common action
		
		r1 = SD_SendCommand_NoDeassert (CMD24, sector, 0xff); // write command
		if (r1)
		{
			MSD_CS_DISABLE();
			return 1; // response is not correct, a direct return
		}
		
		bsp_readwritebyte_spi1 (0xFE); // put initial token 0xFE
		
		// Put data in a sector
		for (i = 0; i <512; i++) 
			bsp_readwritebyte_spi1 (*pBuffer++);
		
		// Send the dummy CRC Byte 2
		bsp_readwritebyte_spi1 (0xff);
		bsp_readwritebyte_spi1 (0xff);
		
		if (SD_WaitDataReady ())// SD card data is written to wait for the completion
		{
			MSD_CS_DISABLE();
			return 2;
		}
		
		Offset += 512;
	}
	
	// Write completed, set to 1 chip select	
	MSD_CS_DISABLE();
	bsp_readwritebyte_spi1 (0xff);
	
	return 0;
	
}
// Read the MSD / SD data
// PBuffer: Data Storage
// ReadAddr: Read the first address
// NumByteToRead: number of bytes to read
// Return value: 0, read out the complete
// Others, read failure
u8 MSD_ReadBuffer (u8 * pBuffer, u32 ReadAddr, u32 NumByteToRead)
{
	u32 NbrOfBlock = 0, Offset = 0;
	u32 sector = 0;
	u8 r1 = 0;
	
	NbrOfBlock = NumByteToRead / BLOCK_SIZE;
	
	MSD_CS_ENABLE();
	
	while (NbrOfBlock--)
	{
		sector = ReadAddr + Offset;
		if (SD_Type == SD_TYPE_V2HC) 
			sector >>= 9; // perform the reverse operation and common action
			
		r1 = SD_SendCommand_NoDeassert (CMD17, sector, 0xff); // read command
		if (r1) // command to send an error
		{
			MSD_CS_DISABLE();
			return r1;
		}
		
		r1 = SD_ReceiveData (pBuffer, 512, RELEASE);
		if (r1) // reading error
		{
			MSD_CS_DISABLE();
			return r1;
		}
		
		pBuffer += 512;
		Offset += 512;
	}
	
	MSD_CS_DISABLE();
	bsp_readwritebyte_spi1 (0xff);
	
