lamilami/jk-stm32f103-rabbit/sw/all_demo/mmc_sd.c
	return 0;
}
//////////////////////////////////////////////////////////////////////////
// Write SD card, a block (not actually tested)
// Input: u32 sector sector address (sector value, non-physical address)
// U8 * buffer data storage location (size at least 512byte)
// Return value: 0: Success
// Other: failure
u8 SD_WriteSingleBlock (u32 sector, const u8 * data)
{
	u8 r1;
	u16 i;
	u16 retry;

	// Set to high-speed mode
	// SPIx_SetSpeed(SPI_SPEED_HIGH);
	
	// If it is not SDHC, given that the sector address, convert it into a byte address
	if (SD_Type != SD_TYPE_V2HC)
	{
		sector = sector <<9;
	}
	
	r1 = SD_SendCommand (CMD24, sector, 0x00);
	if (r1 != 0x00)
	{
		return r1; // response is not correct, a direct return
	}

	// Start preparing data
	MSD_CS_ENABLE();
	// First put three empty data, SD card ready to wait
	bsp_readwritebyte_spi1 (0xff);
	bsp_readwritebyte_spi1 (0xff);
	bsp_readwritebyte_spi1 (0xff);
	// Put initial token 0xFE
	bsp_readwritebyte_spi1 (0xFE);

	// Put data in a sector
	for (i = 0; i <512; i++)
	{
		bsp_readwritebyte_spi1 (* data++);
	}
	
	// Send a dummy CRC Byte 2
	bsp_readwritebyte_spi1 (0xff);
	bsp_readwritebyte_spi1 (0xff);

	// Wait for answer SD Card
	r1 = bsp_readwritebyte_spi1 (0xff);
	if ((r1 & 0x1F) != 0x05)
	{
	    MSD_CS_DISABLE();
	    return r1;
	}

	// Wait operation is completed
	retry = 0;
	while ( !bsp_readwritebyte_spi1 (0xff))
	{
	    retry++;
	    if (retry> 0xfffe) // if not done for a long time to write, error exit
	    {
	        MSD_CS_DISABLE();
	        return 1; // write timeout return 1
	    }
	}
	// Write completed, set to 1 chip select
	MSD_CS_DISABLE();
	bsp_readwritebyte_spi1 (0xff);

	return 0;
}

// Read more than one SD card block (actually tested)
// Input: u32 sector sector address (sector value, non-physical address)
// U8 * buffer data storage location (size at least 512byte)
// U8 count one continuous block read count
// Return value: 0: Success
// Other: failure
u8 SD_ReadMultiBlock (u32 sector, u8 * buffer, u8 count)
{
    u8 r1;
	
	// SPIx_SetSpeed(SPI_SPEED_HIGH); // set to high-speed mode
	
	// If it is not SDHC, the sector addresses turn into a byte address
	if (SD_Type != SD_TYPE_V2HC) 
		sector = sector <<9;

	// SD_WaitDataReady ();
	// Read multi-block commands issued
	r1 = SD_SendCommand (CMD18, sector, 0); // read command
	if (r1 != 0x00) return r1;
	
	do // Start receiving data
	{
	    if (SD_ReceiveData (buffer, 512, NO_RELEASE) != 0x00) break;
	    buffer += 512;
	} while (--count);
	
	// All the transmission is completed, send the stop command
	SD_SendCommand (CMD12, 0, 0);
	
	// Release bus
	MSD_CS_DISABLE();
	bsp_readwritebyte_spi1 (0xFF);
	
	if (count != 0) 
		return count; // end if not passed, return the remaining number of
	else 
		return 0;
	
}
// Write SD card, N-block (not actually tested)
// Input: u32 sector sector address (sector value, non-physical address)
// U8 * buffer data storage location (size at least 512byte)
// U8 count the number of write block
// Return value: 0: Success
// Other: failure
u8 SD_WriteMultiBlock (u32 sector, const u8 * data, u8 count)
{
	u8 r1;
	u16 i;

	// SPIx_SetSpeed (SPI_SPEED_HIGH); // set to high-speed mode
	
	if (SD_Type != SD_TYPE_V2HC) 
		sector = sector <<9; // If it is not SDHC, given that the sector address, convert it to byte address
	if (SD_Type != SD_TYPE_MMC) 
		r1 = SD_SendCommand (ACMD23, count, 0x00); // If the target card is not the MMC card, enable the command to enable pre-erase ACMD23
		
	r1 = SD_SendCommand (CMD25, sector, 0x00); // send multi-block write command
	if (r1 != 0x00) 
		return r1; // response is not correct, a direct return
		
	MSD_CS_ENABLE(); // start preparing data
	
	bsp_readwritebyte_spi1 (0xff); // first put three empty data, SD card ready to wait
	bsp_readwritebyte_spi1 (0xff);
	//-------- The following is written by N-loop part of the sector
	
	do
	{
		// Put the start token that is a multi-block write 0xFC
		bsp_readwritebyte_spi1 (0xFC);
		// Put data in a sector
		for (i = 0; i <512; i++)
		{
			bsp_readwritebyte_spi1 (* data++);
		}
		// Send a dummy CRC Byte 2
		bsp_readwritebyte_spi1 (0xff);
		bsp_readwritebyte_spi1 (0xff);

		// Wait for answer SD Card
		r1 = bsp_readwritebyte_spi1 (0xff);
		if ((r1 & 0x1F) != 0x05)
		{
			MSD_CS_DISABLE(); // If the response is an error, then exit with error code
			return r1;
		}
		// Wait for write to complete the SD card
		if (SD_WaitDataReady () == 1)
		{
			MSD_CS_DISABLE(); // wait for write to complete the SD card out, exit error
			return 1;
		}
	} while (--count); // completion of the sector data transfer
	
	// Send end of the transmission token 0xFD
	r1 = bsp_readwritebyte_spi1 (0xFD);
	if (r1 == 0x00)
	{
		count = 0xfe;
	}
	
	if (SD_WaitDataReady ()) // wait for ready
	{
		MSD_CS_DISABLE();
		return 1;
	}
	// Write completed, set to 1 chip select
	MSD_CS_DISABLE();
	bsp_readwritebyte_spi1 (0xff);
	
	return count; // return count value, if finished then count = 0, otherwise, count = 1
	
}
// In the specified sector, began to read out bytes from the offset byte
// Input: u32 sector sector address (sector value, non-physical address)
// U8 * buf data storage addresses (size <= 512byte)
// U16 offset offset inside the sector
// U16 bytes number of bytes to read
// Return value: 0: Success
// Other: failure
u8 SD_Read_Bytes (unsigned long address, unsigned char * buf, unsigned int offset, unsigned int bytes)
{
	u8 r1; u16 i = 0;
	r1 = SD_SendCommand (CMD17, address <<9,0); // send the Read Sector command
	
	if (r1) 
		return r1; // response is not correct, a direct return
		
	MSD_CS_ENABLE(); // select the SD card
	
	if (SD_GetResponse (0xFE)) // wait for data sent back to the starting SD card token 0xFE
	{
		MSD_CS_DISABLE(); // close the SD card
		return 1; // read failure
	}
	
	for (i = 0; i <offset; i++) bsp_readwritebyte_spi1 (0xff); // skip the offset bits
	for (; i <offset + bytes; i++) * buf++= bsp_readwritebyte_spi1 (0xff); // read the useful data
	for (; i <512; i++) bsp_readwritebyte_spi1 (0xff); // read the remaining bytes
	
	bsp_readwritebyte_spi1 (0xff); // send the pseudo-code CRC
	bsp_readwritebyte_spi1 (0xff);
	
	MSD_CS_DISABLE(); // close the SD card
	
	return 0;
}

u8 SD_WaitReady(void)
{
    u8 r1;
    u16 retry;
    retry = 0;
    do
    {
        r1 = bsp_readwritebyte_spi1(0xFF);
        if(retry==0xfffe)
        {
            return 1;
        }
    }while(r1!=0xFF);

    return 0;
}

